Revit 2025 API
PartUtils.GetSplittingCurves(Document, ElementId) Method
 Identifies the curves that were used to create the part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public static IList<Curve> GetSplittingCurves(
	Document document,
	ElementId partId
)
Public Shared Function GetSplittingCurves (
	document As Document,
	partId As ElementId
) As IList(Of Curve)
public:
static IList<Curve^>^ GetSplittingCurves(
	Document^ document,
	ElementId^ partId
)
static member GetSplittingCurves :
        document : Document *
        partId : ElementId -> IList<Curve>
Parameters
document Document
 The source document of the part.
partId ElementId
 The part id.
Return Value
IList<Curve>
 The curves that created the part. Empty if partId is not a Part or Part is not divided.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Example
public void GetCurveDividers(Part part)
{
   StringBuilder message = new StringBuilder();
   // Get curve dividers.
   IList<Curve> divisionCurves = PartUtils.GetSplittingCurves(part.Document, part.Id);
   if (divisionCurves.Count == 0)
      message.AppendLine("Part is not divided.");
   else
   {
      message.AppendLine("The dividers are : ");
      if (divisionCurves.Count > 0)
         message.AppendLine(divisionCurves.Count.ToString() + " division curves");
   }
   TaskDialog.Show("Revit", message.ToString());
}
Public Sub GetCurveDividers(ByVal part As Part)
    Dim message As StringBuilder = New StringBuilder
    ' Get curve dividers.
    Dim divisionCurves As IList(Of Curve) = PartUtils.GetSplittingCurves(part.Document, part.Id)
    If (divisionCurves.Count = 0) Then
        message.AppendLine("Part is not divided.")
    Else
        message.AppendLine("The dividers are : ")
        If (divisionCurves.Count > 0) Then
            message.AppendLine((divisionCurves.Count.ToString + " division curves"))
        End If
    End If
    TaskDialog.Show("Revit", message.ToString)
End Sub
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
PartUtils Class
GetSplittingCurves Overload
Autodesk.Revit.DB Namespace